Documents/ЛБ_КорректировкаНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_КорректировкаНакладной</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОтгруженныеНакладные</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ЗалоговыеБилетыЗаблокированные</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СогласованиеОплатыОтгруженныхЗБ</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВПути</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СтатусыОбъектовЗалогаВНакладной</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СтатусыНакладнойНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКорректировкиНакладной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗалоговыеБилеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НакладнаяНаОтгрузку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаБлокировки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеБлокировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменитьБлокировку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ЗалоговыеБилетыЗаблокированные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЗалоговыеБилетыЗаблокированные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБлокировкиЗБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолгаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СтатусыОбъектовЗалогаВНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаВНакладной</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтгруженныеНакладные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтгруженныеНакладные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесИзделий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СогласованиеОплатыОтгруженныхЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СогласованиеОплатыОтгруженныхЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыБлокировкиЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыБлокировкиЗБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Блокировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаБлокировки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_КорректировкаНакладной/Ext/ObjectModule.bsl
Функция ПолучитьДатуПоследнейБлокировки(ЗалоговыйБилет)   
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);  
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.ДатаБлокировки КАК ДатаБлокировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЗалоговыеБилетыЗаблокированные КАК ЛБ_ЗалоговыеБилетыЗаблокированные
	               |ГДЕ
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыБлокировкиЗБ.Блокировка)
	               |	И ЛБ_ЗалоговыеБилетыЗаблокированные.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_ЗалоговыеБилетыЗаблокированные.Период < &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.Период УБЫВ"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ДатаБлокировки;
	КонецЕсли;	               
	Возврат неопределено;
КонецФункции	
	 
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ИсключениеЗБИзНакладной Тогда  
		ТаблицаНакладных = ЭтотОбъект.ЗалоговыеБилеты.Выгрузить();
		ТаблицаНакладных.Свернуть("НакладнаяНаОтгрузку"); 
		Для каждого стрН Из ТаблицаНакладных Цикл    
			Отбор = Новый Структура;
			Отбор.Вставить("НакладнаяНаОтгрузку", стрН.НакладнаяНаОтгрузку);
			СписокОЗ = Новый СписокЗначений; 
			СписокЗБ = Новый СписокЗначений;
			Строки = ЗалоговыеБилеты.НайтиСтроки(Отбор);
			Для каждого стр Из Строки Цикл 
				Если СписокОЗ.НайтиПоЗначению(Стр.ОбъектЗалога) = неопределено Тогда
				    СписокОЗ.Добавить(Стр.ОбъектЗалога);  
				КонецЕсли;	
				Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда
				    СписокЗБ.Добавить(Стр.ЗалоговыйБилет);  
				КонецЕсли;
			КонецЦикла;	
			//МоментДоДокумента = Новый Граница(Новый МоментВремени(стрН.НакладнаяНаОтгрузку.Дата, стрН.НакладнаяНаОтгрузку), ВидГраницы.Исключая);
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", стрН.НакладнаяНаОтгрузку.Дата-1);
			Запрос.УстановитьПараметр("ОбъектыЗалога", СписокОЗ);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
			               |ИЗ
			               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ОбъектЗалога В (&ОбъектыЗалога)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
			ТаблицаОЗ = Запрос.Выполнить().Выгрузить();  			
			
			Запрос.УстановитьПараметр("ДатаДок", Дата);
			Запрос.УстановитьПараметр("Накладная", СтрН.НакладнаяНаОтгрузку);
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
			               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
			               |ИЗ
			               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&ДатаДок, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних";
			ТаблицаСтатусовВНакладной = Запрос.Выполнить().Выгрузить();  
			
			Запрос.Текст ="ВЫБРАТЬ
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард КАК Ломбард,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
			              |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
			              |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток) КАК Вес,
			              |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток) КАК СуммаОценки
			              |ИЗ
			              |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&ДатаДок, НакладнаяНаОтгрузку = &Накладная) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки
			              |
			              |СГРУППИРОВАТЬ ПО
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку,
			              |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард";
            ТаблицаПодлежитОтгрузке = Запрос.Выполнить().Выгрузить(); 
		
			Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
			Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина;
			Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
			КолИсключить = 0;
			ВесИсключить = 0;  
			СуммаОценкиИсключить = 0;

			Для каждого Стр Из Строки Цикл			
				Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
		        Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Отбор = Новый структура;
				Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
				Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
	            СтрокиОЗ = ТаблицаОЗ.НайтиСтроки(Отбор); 
				Если НЕ СтрокиОЗ.Количество() = 0 Тогда
					СтрОЗ = СтрокиОЗ.Получить(0);
					Движение.СтатусОбъектаЗалога = СтрОЗ.СтатусОбъектаЗалога;
					Движение.СуммаОценкиНачальная = СтрОЗ.СуммаОценкиНачальная; 
					Движение.СуммаЗайма = СтрОЗ.СуммаЗайма; 
					Движение.СуммаДолгаЗайма = СтрОЗ.СуммаДолгаЗайма;
					Движение.СуммаОплаты = СтрОЗ.СуммаОплаты;
					Движение.СуммаОценки = СтрОЗ.СуммаОценки; 
				КонецЕсли;
				
				Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		       	Движение.НакладнаяНаОтгрузку = Стр.НакладнаяНаОтгрузку;
				Движение.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной;
				
				ОтборС = Новый структура;
				ОтборС.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
				ОтборС.Вставить("ОбъектЗалога", Стр.ОбъектЗалога); 
	            ОтборС.Вставить("НакладнаяНаОтгрузку", СтрН.НакладнаяНаОтгрузку); 
				СтрокиС = ТаблицаСтатусовВНакладной.НайтиСтроки(ОтборС);
				Если НЕ СтрокиС.Количество() = 0 Тогда
					СтрС = СтрокиС.Получить(0);
					СтрС.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной; 
					
					Отбор = Новый структура;
					Отбор.Вставить("ЗалоговыйБилет", СтрС.ЗалоговыйБилет); 
					Отбор.Вставить("ОбъектЗалога", СтрС.ОбъектЗалога); 
					
					СтрокиДок = СтрН.НакладнаяНаОтгрузку.Залоги.НайтиСтроки(Отбор);
					Для каждого СтрДок Из СтрокиДок Цикл
						КолИсключить = КолИсключить + СтрДок.Количество;  
						ВесИсключить = ВесИсключить + СтрДок.Вес;
						СуммаОценкиИсключить = СуммаОценкиИсключить + СтрДок.СуммаОценки;
					КонецЦикла	
				КонецЕсли;    
				
				СтрокиПО = ТаблицаПодлежитОтгрузке.НайтиСтроки(Отбор);
				Если НЕ СтрокиПО.Количество() = 0 Тогда 
					СтрПО = СтрокиПО.Получить(0);
					Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
				    Движение.Организация = ЭтотОбъект.Организация; 
					Движение.Ломбард = СтрПО.Ломбард;   
					Движение.НакладнаяНаОтгрузку = СтрПО.НакладнаяНаОтгрузку;
					Движение.ЗалоговыйБилет = СтрПО.ЗалоговыйБилет;
					Движение.ОбъектЗалога = СтрПО.ОбъектЗалога;
					Движение.Количество = СтрПО.Количество; 
					Движение.Вес = СтрПО.Вес;
					Движение.СуммаОценки = СтрПО.СуммаОценки;
                КонецЕсли;
			Конеццикла;	  
		
			//Если все изделия из накланой исключены 
			Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;
			ВсеИсключенные = Истина; 
			Для каждого СтрС Из ТаблицаСтатусовВНакладной Цикл  
				Если НЕ СтрС.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда 
					ВсеИсключенные = Ложь;
					Продолжить;
				КонецЕсли;	   
			КонецЦикла;
			
			Если ВсеИсключенные Тогда
				ЗапросН = Новый Запрос; 
				ЗапросН.УстановитьПараметр("Дата", Дата-1); 
				ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", СтрН.НакладнаяНаОтгрузку);
				ЗапросН.Текст = "ВЫБРАТЬ
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
				                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий
				                |ИЗ
				                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";
			    ВыборкаН = ЗапросН.Выполнить().Выбрать();
				Если ВыборкаН.Следующий() Тогда
					Движение = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
					Движение.Период = Дата;
					Движение.НакладнаяНаОтгрузку = ВыборкаН.НакладнаяНаОтгрузку; 
					Движение.НомерНакладной = ВыборкаН.НомерНакладной;
					Движение.ДатаНакладной = ВыборкаН.ДатаНакладной;
					Движение.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
					Движение.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;
					Движение.СтатусНакладной = ВыборкаН.СтатусНакладной;
					Движение.Комментарий = ВыборкаН.Комментарий; 				
					Движение.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
					Движение.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
					Движение.Пустой = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина; 			
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина; 
			Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
			Для каждого Элемент Из СписокЗБ Цикл
				ЗалоговыйБилет = Элемент.Значение;				
				Отбор = Новый структура;
				Отбор.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);  
				Строки = ЭтотОбъект.ЗалоговыеБилеты.НайтиСтроки(Отбор);
				
				Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
				Движение.Период = Дата;   
				Движение.ВидОперации = строка(ЭтотОбъект.ВидОперации);
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
		        Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
		        Движение.Организация = Организация;
				Движение.Ломбард = Строки.Получить(0).Ломбард; 
				Движение.НакладнаяНаОтгрузку = Строки.Получить(0).НакладнаяНаОтгрузку;  
				Если  Строки.Получить(0).Заблокировать Тогда
				    Движение.Комментарий = "Блокировка до " + Формат(Строки.Получить(0).ДатаБлокировки, "ДФ=dd.MM.yyyy");
				КонецЕсли;	
				
				Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить(); 
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = ЗалоговыйБилет;
				Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
				Движение.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета; 
				Движение.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования; 
				СтруктураЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилетаДоНакладной(СтрН.НакладнаяНаОтгрузку, ЗалоговыйБилет);
				Если НЕ СтруктураЗБ = неопределено Тогда
				    Движение.СуммаЗайма = СтруктураЗБ.СуммаЗайма; 
					Движение.ДатаНачалаРасчетаПроцентов = СтруктураЗБ.ДатаНачалаРасчета;
					Движение.ДатаВыкупа = СтруктураЗБ.ДатаВыкупа;
					Движение.ДатаВыкупаЛьготныйСрок = СтруктураЗБ.ДатаВыкупаЛьготныйСрок;
					Движение.НомерДопСоглашения = СтруктураЗБ.НомерДопСоглашения;
					Движение.ПричинаПрименения = СтруктураЗБ.ПричинаПрименения;  			
				    Движение.СтатусЗалоговогоБилета =  СтруктураЗБ.СтатусЗалоговогоБилета;   					
				КонецЕсли;	
			КонецЦикла;   
		КонецЦикла;	      
		Движения.ЛБ_ЗалоговыеБилетыЗаблокированные.Записывать = Истина;
		ТаблицаЗБ = ЭтотОбъект.ЗалоговыеБилеты.Выгрузить();
		ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
		Для каждого СтрЗБ Из ТаблицаЗБ Цикл 
			Отбор = новый Структура;
			Отбор.Вставить("ЗалоговыйБилет", СтрЗБ.ЗалоговыйБилет);
			Строки = ЭтотОбъект.ЗалоговыеБилеты.НайтиСтроки(Отбор); 
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = Строки.Получить(0);
				Если Стр.Заблокировать Тогда 
					Движение = Движения.ЛБ_ЗалоговыеБилетыЗаблокированные.Добавить(); 
					Движение.Период = Дата;
	                Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.Статус = Перечисления.ЛБ_СтатусыБлокировкиЗБ.Блокировка; 
					Движение.ДатаБлокировки = Стр.ДатаБлокировки;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	       

	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.БлокировкаВключенияЗБВНакладные Тогда	  
		Движения.ЛБ_ЗалоговыеБилетыЗаблокированные.Записывать = Истина; 
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;

		СписокЗБ = Новый СписокЗначений; 
		СписокЗБОтменить = Новый СписокЗначений;
		Для каждого стр Из ЗалоговыеБилеты Цикл 
			Если Стр.ОтменитьБлокировку Тогда
				Если СписокЗБОтменить.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда
				    СписокЗБОтменить.Добавить(Стр.ЗалоговыйБилет);  
				КонецЕсли;  
			ИначеЕсли Стр.Заблокировать Тогда	
				Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда
				    СписокЗБ.Добавить(Стр.ЗалоговыйБилет);  
				КонецЕсли;  
			КонецЕсли;	
		КонецЦикла;	   
		
		Для каждого Элемент Из СписокЗБ Цикл
			ЗалоговыйБилет = Элемент.Значение;
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);  
			Строки = ЭтотОбъект.ЗалоговыеБилеты.НайтиСтроки(Отбор);
				
     		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;   
			Движение.ВидОперации = строка(ЭтотОбъект.ВидОперации);
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
	        Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
	        Движение.Организация = Организация;
			Движение.Ломбард = Строки.Получить(0).Ломбард; 
			Движение.Комментарий = "Блокировка до " + Формат(Строки.Получить(0).ДатаБлокировки, "ДФ=dd.MM.yyyy") + 
			    ?(НЕ ПустаяСтрока(Строки.Получить(0).ОснованиеБлокировки), ", основание: " + Строки.Получить(0).ОснованиеБлокировки, "");   
				
			Движение = Движения.ЛБ_ЗалоговыеБилетыЗаблокированные.Добавить(); 
			Движение.Период = Дата;
            Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.Статус = Перечисления.ЛБ_СтатусыБлокировкиЗБ.Блокировка; 
			Движение.ДатаБлокировки = Строки.Получить(0).ДатаБлокировки;
		КонецЦикла;	     
		
		Для каждого Элемент Из СписокЗБОтменить Цикл
			ЗалоговыйБилет = Элемент.Значение;
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);  
			Строки = ЭтотОбъект.ЗалоговыеБилеты.НайтиСтроки(Отбор);
				
     		Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;   
			Движение.ВидОперации = строка(ЭтотОбъект.ВидОперации);
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
	        Движение.Залогодатель = ЗалоговыйБилет.Залогодатель;
	        Движение.Организация = Организация;   
			СтрДок = Строки.Получить(0);
			Движение.Ломбард = СтрДок.Ломбард;  
			ДатаБлокировки = ПолучитьДатуПоследнейБлокировки(ЗалоговыйБилет);
			Движение.Комментарий = "Отмена блокировки" + ?(ДатаБлокировки = неопределено, "", " до " + Формат(ДатаБлокировки, "ДФ=dd.MM.yyyy")) +
			    ?(НЕ ПустаяСтрока(СтрДок.ОснованиеБлокировки), ", основание: " + СтрДок.ОснованиеБлокировки, "");  
			Движение.ОтменаБлокировки = Истина;	
				
			Движение = Движения.ЛБ_ЗалоговыеБилетыЗаблокированные.Добавить(); 
			Движение.Период = Дата;
            Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.Статус = Перечисления.ЛБ_СтатусыБлокировкиЗБ.ОтменаБлокировки; 
		КонецЦикла;	              
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтменаОтгрузкиНакладных Тогда	
		СписокН = новый СписокЗначений;
		Для каждого Стр Из ЭтотОбъект.ЗалоговыеБилеты Цикл 
			Если СписокН.НайтиПоЗначению(Стр.НакладнаяНаОтгрузку) = неопределено  Тогда 
				СписокН.Добавить(Стр.НакладнаяНаОтгрузку);
			КонецЕсли;;                      
		Конеццикла;	
		
		ЗапросОтгрузки = Новый Запрос;  
		ЗапросОтгрузки.УстановитьПараметр("Дата", Дата); 
		ЗапросОтгрузки.Текст = "ВЫБРАТЬ
		                       |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Регистратор КАК Регистратор,
		                       |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период КАК Период
		                       |ИЗ
		                       |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
		                       |ГДЕ
		                       |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период < &Дата
		                       |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
		                       |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		                       |
		                       |УПОРЯДОЧИТЬ ПО
		                       |	Период УБЫВ";  		
		
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("Накладные", СписокН);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, НакладнаяНаОтгрузку В (&Накладные)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних"; 
		ТаблицаСтатусовВНакладных = Запрос.Выполнить().Выгрузить();  
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Регистратор КАК Регистратор,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Ломбард КАК Ломбард,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Количество КАК Количество,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Вес КАК Вес,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.СуммаОценки КАК СуммаОценки
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
		               |ГДЕ
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период < &Дата
		               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку В(&Накладные)
		               |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
		ТаблицаОтгрузок = Запрос.Выполнить().Выгрузить();
		
			
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина; 		
		ТаблицаЗБ = ЭтотОбъект.ЗалоговыеБилеты.Выгрузить();  
		ТаблицаЗБ.Свернуть("Ломбард, НакладнаяНаОтгрузку, ЗалоговыйБилет");
		Для каждого СтрЗБ Из ТаблицаЗБ Цикл
		    Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;                        
			Движение.ВидОперации = "Отмена отгрузки накладной";
			Движение.ЗалоговыйБилет = СтрЗБ.ЗалоговыйБилет;
	        Движение.Залогодатель = СтрЗБ.ЗалоговыйБилет.Залогодатель;
	        Движение.Организация = ЭтотОбъект.Организация;
			Движение.Ломбард = СтрЗБ.Ломбард; 
			Движение.НакладнаяНаОтгрузку = СтрЗБ.НакладнаяНаОтгрузку;
			Движение.Комментарий = "Отмена отгрузки сотрудником ЦО";
		КонецЦикла;	
		
		НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.СумкаЗакрыта;
	 	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина;  
		Для каждого Выборка Из ТаблицаСтатусовВНакладных Цикл  			
			Если Выборка.статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда
				Продолжить;
			КонецЕсли;	
			Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			Движение.ОбъектЗалога = Выборка.ОбъектЗалога;
	       	Движение.НакладнаяНаОтгрузку = Выборка.НакладнаяНаОтгрузку;
			Движение.Статус = НовыйСтаусОбъектаЗалогаВНакладной;
		КонецЦикла; 
		
		ЗапросН = Новый Запрос; 
		ЗапросН.УстановитьПараметр("Дата", Дата-1); 
		ЗапросН.Текст = "ВЫБРАТЬ
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий
		                |ИЗ
		                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";

		Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
		Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;
		Для каждого Эл Из СписокН Цикл 
			Накладная = Эл.Значение;  
			ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);
			ВыборкаН = ЗапросН.Выполнить().Выбрать();
			Если ВыборкаН.Следующий() Тогда
				ДвижениеН = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
				ДвижениеН.Период = Дата;
				ДвижениеН.НакладнаяНаОтгрузку = ВыборкаН.НакладнаяНаОтгрузку; 
				ДвижениеН.НомерНакладной = ВыборкаН.НомерНакладной;
				ДвижениеН.ДатаНакладной = ВыборкаН.ДатаНакладной;
				ДвижениеН.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
				ДвижениеН.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;
				ДвижениеН.СтатусНакладной = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта; 
				ДвижениеН.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник; 
				ДвижениеН.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
				ДвижениеН.Комментарий = "Отмена отгрузки сотрудником ЦО";
			КонецЕсли;	

			СписокЗБ = новый СписокЗначений;
		    ЗапросОтгрузки.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);
			ВыборкаОтгрузки = ЗапросОтгрузки.Выполнить().Выбрать();
			Если ВыборкаОтгрузки.Следующий() Тогда   
				Отбор = Новый структура;   
				Отбор.Вставить("Регистратор", ВыборкаОтгрузки.Регистратор); 
			    Отбор.Вставить("НакладнаяНаОтгрузку", Накладная); 
				Строки = ТаблицаОтгрузок.НайтиСтроки(Отбор);
				Для каждого Стр Из Строки Цикл
					Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
				    Движение.Организация = ЭтотОбъект.Организация; 
					Движение.Ломбард = Стр.Ломбард;   
					Движение.НакладнаяНаОтгрузку = Стр.НакладнаяНаОтгрузку;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество; 
					Движение.Вес = Стр.Вес;
					Движение.СуммаОценки = Стр.СуммаОценки;  
					Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда
						СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
					КонецЕсли;	
				КонецЦикла;	     
			КонецЕсли;	
			
			Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
			Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
			Запрос.УстановитьПараметр("Дата", Накладная.Дата);  
			Запрос.УстановитьПараметр("ЗБ", СписокЗБ); 
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
			               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
			               |ИЗ
			               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
			ТаблицаОЗ = Запрос.Выполнить().Выгрузить(); 
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений,
			               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОплатыБезПродления КАК ДатаОплатыБезПродления
			               |ИЗ
			               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				 Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить(); 
				 Движение.Период = Дата;       
				 Движение.СтатусЗалоговогоБилета = Выборка.СтатусЗалоговогоБилета;
				 Движение.Залогодатель = Выборка.Залогодатель;
			     Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			     Движение.НомерЗалоговогоБилета = Выборка.НомерЗалоговогоБилета;
			     Движение.СхемаКредитования = Выборка.ЗалоговыйБилет.СхемаКредитования;
			     Движение.ПричинаПрименения = Выборка.ПричинаПрименения;			     
			     Движение.СуммаЗайма = Выборка.СуммаЗайма;
			     Движение.ДатаНачалаРасчетаПроцентов = Выборка.ДатаНачалаРасчетаПроцентов;
			     Движение.НомерДопСоглашения = Выборка.НомерДопСоглашения;
			     Движение.ДатаВыкупа = Выборка.ДатаВыкупа;
			     Движение.ДатаВыкупаЛьготныйСрок = Выборка.ДатаВыкупаЛьготныйСрок;
			     Движение.СуммаПроцентовДень = Выборка.СуммаПроцентовДень;
			     Движение.СуммаПроцентовСрок = Выборка.СуммаПроцентовСрок;
			     Движение.ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
			     Движение.ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни;
			     Движение.ДатаОстановкиНачислений = Выборка.ДатаОстановкиНачислений;
			     Движение.ДатаОплатыБезПродления = Выборка.ДатаОплатыБезПродления;
				 
				 Отбор = Новый Структура;
				 Отбор.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
				 Строки = ТаблицаОЗ.НайтиСтроки(Отбор);                 
				 Для каждого стр из строки цикл
				     Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить(); 
				     Движение.Период = Дата;  
				     Движение.СтатусОбъектаЗалога = Стр.СтатусОбъектаЗалога;
				     Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				     Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				     Движение.СуммаДолгаЗайма = Стр.СуммаДолгаЗайма;
				     Движение.СуммаЗайма = Стр.СуммаЗайма;
				     Движение.СуммаОплаты = Стр.СуммаОплаты;
				     Движение.СуммаОценки = Стр.СуммаОценки;
				     Движение.СуммаОценкиНачальная = Стр.СуммаОценкиНачальная;
				 КонецЦикла;	 
           Конеццикла;	
        КонецЦикла;	     
		
		//сторнируем списание объектов залога из накладной со склада  
		ЗапросР = Новый Запрос;  
		ЗапросР.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
		ЗапросР.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОтгруженныеНакладные.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрСведений.ЛБ_ОтгруженныеНакладные КАК ЛБ_ОтгруженныеНакладные
		               |ГДЕ
		               |	ЛБ_ОтгруженныеНакладные.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
		               |	И ЛБ_ОтгруженныеНакладные.Период < &Дата";
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;
		Движения.ЛБ_ОбъектыЗалогаВПути.Записывать = Истина;
		//Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Для каждого Эл Из СписокН Цикл 
			Накладная = Эл.Значение;
			ЗапросР.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);
			ВыборкаР = ЗапросР.Выполнить().Выбрать();
			Если ВыборкаР.Следующий() Тогда
			    ДокументДляОтмены = ВыборкаР.Регистратор;
				
				НаборЗаписей = РегистрыНакопления.ЛБ_ОбъектыЗалога.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументДляОтмены);
				НаборЗаписей.Прочитать(); 

				Для каждого Запись Из НаборЗаписей Цикл				
					Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Запись.Организация;
					Движение.ВидДвижения = Запись.ВидДвижения;
					Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет; 
					Движение.Ломбард = Запись.Ломбард;                 
					Движение.Склад = Запись.Склад;
					Движение.ОбъектЗалога = Запись.ОбъектЗалога; 
					Движение.Количество = -Запись.Количество;
					Движение.СуммаОценки = -Запись.СуммаОценки; 
					//Движение.СуммаОценкиНачальная = -Запись.СуммаОценкиНачальная;
				КонецЦикла;	      

             			 
			    НаборЗаписей = РегистрыНакопления.ЛБ_ОбъектыЗалогаВПути.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументДляОтмены);
				НаборЗаписей.Прочитать();	
				
				Для каждого Запись Из НаборЗаписей Цикл					
					 Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
					 Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					 Движение.Период = Дата;
					 Движение.Организация = Запись.Организация;
					 Движение.Отправитель = Запись.Отправитель; 
					 Движение.СкладОтправитель = Запись.СкладОтправитель;
					 Движение.Получатель = Запись.Получатель; 
					 Движение.СкладПолучатель = Запись.СкладПолучатель;
					 Движение.ЗалоговыйБилет = Запись.ЗалоговыйБилет;
					 Движение.ОбъектЗалога = Запись.ОбъектЗалога;
					 Движение.Количество = -Запись.Количество;
					 Движение.СуммаОценки = -Запись.СуммаОценки;  
					 Движение.НакладнаяНаОтгрузку = Запись.НакладнаяНаОтгрузку;
					 Движение.Инкассатор = Запись.Инкассатор;
				КонецЦикла;	
				
				//НаборЗаписей = РегистрыСведений.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.СоздатьНаборЗаписей();
				//НаборЗаписей.Отбор.Регистратор.Установить(ДокументДляОтмены);
				//НаборЗаписей.Прочитать(); 
				//
				//Для каждого Запись Из НаборЗаписей Цикл	
				//	 Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
				//	 Движение.Период = Дата;
				//	 Движение.Организация = Запись.Организация;   
				//	 Движение.ПодразделениеОтправитель = Запись.ПодразделениеОтправитель;
				//	 Движение.СкладОтправитель = Запись.СкладОтправитель;   
				//	 Движение.ПодразделениеПолучатель = Запись.ПодразделениеПолучатель;
				//	 Движение.СкладПолучатель = Запись.СкладПолучатель;
				//	 Движение.Количество = -Запись.Количество;
				//	 Движение.НакладнаяНаОтгрузку = Запись.НакладнаяНаОтгрузку;	 
				//	 Движение.Ответственный = ЭтотОбъект.Ответственный;   
				//	 Движение.ВидОперации = "Отмена отгрузки накладной";
				//КонецЦикла;	 
			КонецЕсли;	
		КонецЦикла	
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОтгрузкаНакладных Тогда	
		СписокН = новый СписокЗначений;
		Для каждого Стр Из ЭтотОбъект.ЗалоговыеБилеты Цикл 
			Если СписокН.НайтиПоЗначению(Стр.НакладнаяНаОтгрузку) = неопределено  Тогда 
				СписокН.Добавить(Стр.НакладнаяНаОтгрузку);
			КонецЕсли;;                      
		Конеццикла;	
		
		ЗапросОтгрузки = Новый Запрос;  
		ЗапросОтгрузки.УстановитьПараметр("Дата", Дата); 
		ЗапросОтгрузки.Текст = "ВЫБРАТЬ
		                       |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Регистратор КАК Регистратор,
		                       |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период КАК Период
		                       |ИЗ
		                       |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке
		                       |ГДЕ
		                       |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Период < &Дата
		                       |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку
		                       |	И ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                       |
		                       |УПОРЯДОЧИТЬ ПО
		                       |	Период УБЫВ";  		
		
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("Накладные", СписокН);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
		               |ИЗ
		               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, НакладнаяНаОтгрузку В (&Накладные)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних"; 
		ТаблицаСтатусовВНакладных = Запрос.Выполнить().Выгрузить();  
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард КАК Ломбард,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога КАК ОбъектЗалога,
		               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
		               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ВесОстаток) КАК Вес,
		               |	СУММА(ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.СуммаОценкиОстаток) КАК СуммаОценки
		               |ИЗ
		               |	РегистрНакопления.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Остатки(&Дата, НакладнаяНаОтгрузку В (&Накладные)) КАК ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.Ломбард,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.НакладнаяНаОтгрузку,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ЗалоговыйБилет,
		               |	ЛБ_ОбъектыЗалогаПодлежащиеОтгрузкеОстатки.ОбъектЗалога";
		ТаблицаНакладных = Запрос.Выполнить().Выгрузить();
		
		Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Записывать = Истина;
		ЗапросН = Новый Запрос; 
		ЗапросН.УстановитьПараметр("Дата", Дата-1); 
		ЗапросН.Текст = "ВЫБРАТЬ
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.НомерНакладной КАК НомерНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ДатаНакладной КАК ДатаНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ОтказОтВыкупа КАК ОтказОтВыкупа,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.ПовышеннаяОценка КАК ПовышеннаяОценка,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СтатусНакладной КАК СтатусНакладной,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Получатель КАК Получатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.СкладПолучатель КАК СкладПолучатель,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Инкассатор КАК Инкассатор,
		                |	ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних.Комментарий КАК Комментарий
		                |ИЗ
		                |	РегистрСведений.ЛБ_СтатусыНакладнойНаОтгрузку.СрезПоследних(&Дата, НакладнаяНаОтгрузку = &НакладнаяНаОтгрузку) КАК ЛБ_СтатусыНакладнойНаОтгрузкуСрезПоследних";  
		Для каждого Эл Из СписокН Цикл     
			Накладная = Эл.Значение;
			ЗапросН.УстановитьПараметр("НакладнаяНаОтгрузку", Накладная);

		    ВыборкаН = ЗапросН.Выполнить().Выбрать();
			Если ВыборкаН.Следующий() Тогда
				ДвижениеН = Движения.ЛБ_СтатусыНакладнойНаОтгрузку.Добавить(); 
				ДвижениеН.Период = Дата;
				ДвижениеН.НакладнаяНаОтгрузку = ВыборкаН.НакладнаяНаОтгрузку; 
				ДвижениеН.НомерНакладной = ВыборкаН.НомерНакладной;
				ДвижениеН.ДатаНакладной = ВыборкаН.ДатаНакладной;
				ДвижениеН.ОтказОтВыкупа = ВыборкаН.ОтказОтВыкупа;
				ДвижениеН.ПовышеннаяОценка = ВыборкаН.ПовышеннаяОценка;
				ДвижениеН.СтатусНакладной = Перечисления.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена; 
				ДвижениеН.ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
				ДвижениеН.ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
				ДвижениеН.Инкассатор = ЭтотОбъект.Инкассатор;
			    ДвижениеН.Получатель = ЭтотОбъект.Получатель;
				ДвижениеН.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
				ДвижениеН.Комментарий = "Отгрузка накладной сотрудником ЦО";
			КонецЕсли;	 
   		КонецЦикла;	
			
		Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина; 		
		ТаблицаЗБ = ЭтотОбъект.ЗалоговыеБилеты.Выгрузить();  
		ТаблицаЗБ.Свернуть("Ломбард, НакладнаяНаОтгрузку, ЗалоговыйБилет");
		Для каждого СтрЗБ Из ТаблицаЗБ Цикл
		    Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата;                        
			Движение.ВидОперации = "Отгрузка накладной";
			Движение.ЗалоговыйБилет = СтрЗБ.ЗалоговыйБилет;
	        Движение.Залогодатель = СтрЗБ.ЗалоговыйБилет.Залогодатель;
	        Движение.Организация = ЭтотОбъект.Организация;
			//Движение.Ломбард = ЭтотОбъект.Получатель;  
			Движение.Ломбард = ЭтотОбъект.Ломбард;
			Движение.НакладнаяНаОтгрузку = СтрЗБ.НакладнаяНаОтгрузку;
			Движение.Комментарий = "Отгрузка накладной сотрудником ЦО";
		КонецЦикла;	
		
		НовыйСтаусОбъектаЗалогаВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено;
	 	Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Записывать = Истина;  
		Для каждого Выборка Из ТаблицаСтатусовВНакладных Цикл  			
			Если Выборка.статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной Тогда
				Продолжить;
			КонецЕсли;	
			Движение = Движения.ЛБ_СтатусыОбъектовЗалогаВНакладной.Добавить();
			Движение.Период = Дата;
			Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
			Движение.ОбъектЗалога = Выборка.ОбъектЗалога;
	       	Движение.НакладнаяНаОтгрузку = Выборка.НакладнаяНаОтгрузку;
			Движение.Статус = НовыйСтаусОбъектаЗалогаВНакладной;
		КонецЦикла; 
				
		Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Записывать = Истина;
		Движения.ЛБ_ОтгруженныеНакладные.Записывать = Истина;
				
		Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги);
        ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Дата-1, Организация, Ломбард, Склад);
		
		ЗапросОЗ = Новый Запрос;  
		ЗапросОЗ.УстановитьПараметр("Дата", Дата);
		ЗапросОЗ.Текст = "ВЫБРАТЬ
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты
		                 |ИЗ
		                 |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
		                 |			&Дата,
		                 |			ЗалоговыйБилет = &ЗалоговыйБилет
		                 |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";

		Для каждого Эл Из СписокН Цикл 
			Накладная = Эл.Значение; 
			СписокЗБ = Новый СписокЗначений;
			 
			Отбор = Новый структура;    
		    Отбор.Вставить("НакладнаяНаОтгрузку", Накладная); 
			Строки = ТаблицаНакладных.НайтиСтроки(Отбор);
			ИтогКоличество = 0;  
			ИтогВес = 0; 
			ИтогСуммаОценки = 0;
			Для каждого Стр Из Строки Цикл
				Движение = Движения.ЛБ_ОбъектыЗалогаПодлежащиеОтгрузке.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
			    Движение.Организация = ЭтотОбъект.Организация; 
				Движение.Ломбард = Ломбард;   
				Движение.НакладнаяНаОтгрузку = Стр.НакладнаяНаОтгрузку;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;  
				Движение.Вес = Стр.Вес;
				Движение.СуммаОценки = Стр.СуммаОценки;  
				ИтогКоличество = ИтогКоличество + Стр.Количество;  
			    ИтогВес = ИтогВес + Стр.Вес; 
			    ИтогСуммаОценки = ИтогСуммаОценки + Стр.СуммаОценки;
																				
				Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда
					СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
				КонецЕсли;	
				
				 ОтборОст = новый структура;
				 ОтборОст.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
				 ОтборОст.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
				 СтрокиОст = ТаблицаОстатков.НайтиСтроки(ОтборОст);
				 Если СтрокиОст.Количество() = 0 Тогда 
					 ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + СокрЛП(Стр.ОбъектЗалога.Артикул) + " не найдено на складе " + СокрЛП(Склад));
				 Иначе        
					 СтрОст = СтрокиОст.Получить(0);
					 Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					 Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					 Движение.Период = Дата;
					 Движение.Организация = ЭтотОбъект.Организация;
					 Движение.Ломбард = Ломбард;
					 Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					 Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					 Движение.Количество = СтрОст.Количество;
					 Движение.СуммаОценки = СтрОст.СуммаОценки; 
					
					 Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
					 Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					 Движение.Период = Дата;
					 Движение.Организация = ЭтотОбъект.Организация;
					 Движение.Отправитель = Ломбард; 
					 Движение.СкладОтправитель = Склад;
					 Движение.Получатель = ЭтотОбъект.Получатель; 
					 Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
					 Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					 Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					 Движение.Количество = СтрОст.Количество;
					 Движение.СуммаОценки = СтрОст.СуммаОценки;  
					 Движение.НакладнаяНаОтгрузку = Накладная;  
					 Движение.Инкассатор = ЭтотОбъект.Инкассатор; 
					 
					 ЗапросОЗ.УстановитьПараметр("ЗалоговыйБилет", Стр.ЗалоговыйБилет);  
					 ЗапросОЗ.УстановитьПараметр("ОбъектЗалога", Стр.ОбъектЗалога);
				     ВыборкаОЗ = ЗапросОЗ.Выполнить().Выбрать();                 
					 Если ВыборкаОЗ.Следующий() Тогда  
					    Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить(); 
				        Движение.Период = Дата;  
					    Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути;
					    Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					    Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					    Движение.СуммаДолгаЗайма = ВыборкаОЗ.СуммаДолгаЗайма;
					    Движение.СуммаЗайма = ВыборкаОЗ.СуммаЗайма;
					    Движение.СуммаОплаты = ВыборкаОЗ.СуммаОплаты;
					    Движение.СуммаОценки = ВыборкаОЗ.СуммаОценки;
					    Движение.СуммаОценкиНачальная = ВыборкаОЗ.СуммаОценкиНачальная;   
					    Движение.Комментарий = "Отправитель: " + СокрЛП(Стр.Ломбард) + ", склад отгрузки " + СокрЛП(Склад) + ", Получатель " +
		                  СокрЛП(ЭтотОбъект.Получатель) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель);	
				 	 КонецЕсли; 

				КонецЕсли;
			КонецЦикла;	  
			Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
			Движение.Период = Дата;
			Движение.Организация = ЭтотОбъект.Организация; 
			Движение.ПодразделениеОсновное = Ломбард; 
			Движение.СкладОсновной = Склад;
			Движение.ПодразделениеОтправитель = Ломбард;
			Движение.СкладОтправитель = Склад;   
			Движение.ПодразделениеПолучатель = ЭтотОбъект.Получатель;
			Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
			Движение.Количество = ИтогКоличество;				
			Движение.НакладнаяНаОтгрузку = Накладная;
			Движение.Инкассатор = ЭтотОбъект.Инкассатор; 
			Движение.Ответственный = ЭтотОбъект.Ответственный;   
			Движение.ВидОперации = "Отгрузка накладной (ЦО)";

			
			//Запрос.УстановитьПараметр("Дата", Накладная.Дата);  
			//Запрос.УстановитьПараметр("ЗБ", СписокЗБ); 
			//Запрос.Текст = "ВЫБРАТЬ
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
			//               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
			//               |ИЗ
			//               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
			//ТаблицаОЗ = Запрос.Выполнить().Выгрузить(); 
			//Для каждого стрОЗ из ТаблицаОЗ цикл
			//	 Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить(); 
			//     Движение.Период = Дата;  
			//	 Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути;
			//	 Движение.ЗалоговыйБилет = СтрОЗ.ЗалоговыйБилет;
			//	 Движение.ОбъектЗалога = СтрОЗ.ОбъектЗалога;
			//	 Движение.СуммаДолгаЗайма = СтрОЗ.СуммаДолгаЗайма;
			//	 Движение.СуммаЗайма = СтрОЗ.СуммаЗайма;
			//	 Движение.СуммаОплаты = СтрОЗ.СуммаОплаты;
			//	 Движение.СуммаОценки = СтрОЗ.СуммаОценки;
			//	 Движение.СуммаОценкиНачальная = СтрОЗ.СуммаОценкиНачальная; 
			//	 Движение.Комментарий = "Отправитель: " + СокрЛП(Стр.Ломбард) + ", склад отгрузки " + СокрЛП(Склад) + ", Получатель " +
			//              СокрЛП(ЭтотОбъект.Получатель) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель);	
			// КонецЦикла;	 


			Движения.ЛБ_ОтгруженныеНакладные.Записывать = Истина;
			Движение = Движения.ЛБ_ОтгруженныеНакладные.Добавить();
			Движение.Период = Дата;
		    Движение.НакладнаяНаОтгрузку = Накладная;
			Движение.КоличествоИзделий = ИтогКоличество;  
			Движение.ВесИзделий = ИтогВес;
			Движение.СуммаОценки = ИтогСуммаОценки;		
		         
		КонецЦикла;	
		
		Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
		Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина;
		Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;  
		Движения.ЛБ_ОбъектыЗалогаВПути.Записывать = Истина; 
		Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина;
		Запрос.УстановитьПараметр("ЗБ", СписокЗБ);   
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма,
		               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних";
		ТаблицаОЗ = Запрос.Выполнить().Выгрузить(); 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерЗалоговогоБилета КАК НомерЗалоговогоБилета,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОстановкиНачислений КАК ДатаОстановкиНачислений,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаОплатыБезПродления КАК ДатаОплатыБезПродления
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			 Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить(); 
			 Движение.Период = Дата;       
			 Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен;
			 Движение.Залогодатель = Выборка.Залогодатель;
		     Движение.ЗалоговыйБилет = Выборка.ЗалоговыйБилет;
		     Движение.НомерЗалоговогоБилета = Выборка.НомерЗалоговогоБилета;
		     Движение.СхемаКредитования = Выборка.ЗалоговыйБилет.СхемаКредитования;
		     Движение.ПричинаПрименения = Выборка.ПричинаПрименения;			     
		     Движение.СуммаЗайма = Выборка.СуммаЗайма;
		     Движение.ДатаНачалаРасчетаПроцентов = Выборка.ДатаНачалаРасчетаПроцентов;
		     Движение.НомерДопСоглашения = Выборка.НомерДопСоглашения;
		     Движение.ДатаВыкупа = Выборка.ДатаВыкупа;
		     Движение.ДатаВыкупаЛьготныйСрок = Выборка.ДатаВыкупаЛьготныйСрок;
		     Движение.СуммаПроцентовДень = Выборка.СуммаПроцентовДень;
		     Движение.СуммаПроцентовСрок = Выборка.СуммаПроцентовСрок;
		     Движение.ПредельныйСрокЗайма = Выборка.ПредельныйСрокЗайма;
		     Движение.ПредельныйСрокЗаймаДни = Выборка.ПредельныйСрокЗаймаДни;
		     Движение.ДатаОстановкиНачислений = Выборка.ДатаОстановкиНачислений;
		     Движение.ДатаОплатыБезПродления = Выборка.ДатаОплатыБезПродления;			 
		 Конеццикла;	   
	 ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыКорректировкиНакладной.ОплатаОтгруженногоЗБ Тогда 
		 Движения.ЛБ_СогласованиеОплатыОтгруженныхЗБ.Записывать = Истина;   
		 Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
      
		 Для каждого Стр Из ЭтотОбъект.ЗалоговыеБилеты Цикл  
			 Движение = Движения.ЛБ_СогласованиеОплатыОтгруженныхЗБ.Добавить(); 
			 Движение.Период = Дата;
			 Движение.Ломбард = стр.Ломбард;
			 Движение.ЗалоговыйБилет = стр.ЗалоговыйБилет;
			 Движение.ДатаОплаты = стр.ДатаОплаты;  
			 
			 Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			 Движение.Период = Дата;   
			 Движение.ВидОперации = "Согласована оплата ЗБ (ЦО)";
			 Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
	         Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
	         Движение.Организация = Организация;
			 Движение.Ломбард = Стр.Ломбард; 
			 Движение.Комментарий = "Оплата согласована до " + Формат(стр.ДатаОплаты, "ДФ=dd.MM.yyyy") + " включительно";  
		 Конеццикла;	 
	КонецЕсли;	
КонецПроцедуры
